// ⁡⁣⁣⁢​‌‌‍Модуль 1. Заняття 1. Змінні, типи та оператори⁡​⁡

let _______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ​‌‌‍⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟭 - Математичні оператори​⁡​
// Виведи на екран загальну кількість яблук та винограду. Різницю яблук та винограду.

// const apples = 47
// const grapes = 135

// const result = apples - grapes
// console.log('result', result)

// const total = apples + grapes
// console.log('total', total)
// const diff = apples - grapes
// console.log('diff', diff)

_______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟮 - Комбіновані оператори​⁡
// Заміни вираз перевизначення комбінованим оператором +=.

// let students = 100
// students = students * 2
// students += 2

// console.log(students)

_______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟯 - Пріоритет операторів​⁡
// Розбери пріоритет операторів в інструкції привласнення значення змінної result.

// const result = 108 + 223 - 2 * 5
// console.log(result)

_______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟰 - Класс 𝗠𝗮𝘁𝗵​⁡
// Напиши скрипт, який виводить у консоль заокруглені вгору/вниз і т.д. значення змінної value.
// Використовуй методи Math.floor(), Math.ceil() та Math.round(). Перевір що буде в консолі при значеннях 27.3 та 27.9.

// const value = 27.5
// console.log('floor', Math.floor(value))
// console.log('ceil', Math.ceil(value))
// console.log('round', Math.round(value))

_______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟱 - Шаблонні рядки​⁡
// Склади фразу за допомогою шаблонних рядків A has B bots in stock, де A, B - змінні вставлені в рядок.

// const companyName = 'Cyberdyne "Maxim" Systems'
// const repairBots = 150
// const defenceBots = 50
// // const result = repairBots + defenceBots
// const message = `${companyName} ${repairBots + defenceBots} bots in stock`
// console.log(message) // "Cyberdyne Systems has 200 bots in stock"

_______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟲 - Методи рядків та чейнінг​⁡
// Напиши скрипт, який розраховує індекс маси тіла людини. Для цього необхідно розділити
// вагу в кілограмах на квадрат висоти людини у метрах.

// Вага та висота зберігаються у змінних weight та height, але не як числа,
// а в вигляді рядків (спеціально для завдання).
// Не цілі числа можуть бути задані у вигляді 24.7 або 24,7, тобто як роздільник дробової частини може бути кома.

// Індекс маси тіла необхідно округлити до однієї цифри після коми;

// let weight = '88,3'
// let height = '1.75'

// const weightSlice = weight.slice(0, 2)
// // const weightSliceEnd = weight.slice(-1)
// // const newWeight = weightSlice + '.' + weightSliceEnd

// const newWeight = weight.replace(',', '.')
// console.log('newWeight', newWeight)
// const bmi = +newWeight / Math.pow(+height, 2)
// const bmi = +newWeight / ((+height)**2)

// console.log(bmi.toFixed(1)) // 28.8

// 1 - convert to Number

_______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟳 - Оператори порівняння та приведення типів​⁡
// Яким буде результат виразів?

// console.log(5 > 4)

// console.log(10 >= '7x') // 10>=7

// console.log('112' > '12')

// console.log('2' < '12')

// console.log('4' == 4)

// console.log('6' === 6)

// console.log('false' === false)

// console.log(1 == true)

// console.log(1 === true)

// console.log('0' == false)

// console.log('0' === false)

// console.log('Papaya' < 'papaya')
// console.log('P', 'P'.charCodeAt())
// console.log('p', 'p'.charCodeAt())

// console.log('Papaya' === 'papaya')

// console.log(undefined == false) //undefined->false->0

// console.log(undefined === null)

_______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟴 - Логічні оператори​⁡
// Яким буде результат виразів?

// console.log(true && 3)

// console.log(false && 3)

// console.log(true && 4 && 'kiwi')

// console.log(true && false && 'kiwi')

// console.log(false || 0 || null)

// console.log(true || 3 || 4)

// console.log(0 || false || 7)

// console.log(null || 2 || undefined)

// console.log((1 && null && 2) > 0)

// console.log(null || (2 && 3) || 4)

_______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟵 - Значення за замовчуванням та оператор нульового злиття​⁡
// Отрефактори код так, щоб у змінну value присвоювалося значення змінної incomingValue,
// якщо воно не рівне undefined або null. В іншому випадку має присвоюватися значення defaultValue.
// Перевір роботу скрипта для наступних значень змінної incomingValue: null, undefined, 0, false.
// Використовуй оператор ?? (nullish coalescing operator).

// const incomingValue = null
// const defaultValue = 10

// 0 || null || 10
// null ?? undefined ?? 10

// const value = incomingValue ?? defaultValue
// console.log(value)

_______________________________________________________________________________________________________________________________________
_______________________________________________________________________________________________________________________________________

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟭𝟬 - Оператор % та методи рядків​⁡
// Напиши скрипт, який переведе значення totalMinutes (кількість хвилин) в рядок у форматі годин та хвилин HH:MM.

// 70 покаже 01:10
// 450 покаже 07:30
// 1441 покаже 24:01
// const totalMinutes = 1441

// const hours = Math.floor(totalMinutes / 60)
// const minutes = totalMinutes % 60

// const newHours = String(hours).padStart(2, 0)
// const newMinutes = String(minutes).padStart(2, 0)

// const result = `${newHours}:${newMinutes}`

// console.log(result)
// console.log(minutes);

// const doubleDigitHours = String(hours).padStart(2, 0);
// const doubleDigitMinutes = String(minutes).padStart(2, 0);
// console.log(`${doubleDigitHours}:${doubleDigitMinutes}`);
