/*
 * Оператори порівняння (<, >, <=, >=, ==, ===, !=, !==)
 */

// const num = 5;
// const numSecond = "5";

// console.log(num !== numSecond);

// !=

// !==

/*
 * Результатом порівняння буде булеве значення.
 * Рядки порівнюються по unicode.
 * При порівнянні рядків, рядки порівнюються посимвольно.
 * При порівнянні різних типів, операнди приводяться до числа.
 */

// console.log("A".charCodeAt(0));

// console.log("a".charCodeAt(0) < "b".charCodeAt(0));

/*
 * Приведення різних типів до числа:
 * true --> 1
 * false --> 0
 * '' --> 0
 * null --> 0
 * undefined --> 0
 */

// console.log(NaN === NaN);

// console.log(isNaN(Number("10")));

//* Оператор більше (>)

//* Оператор менше або дорівнює (<=)

//* Оператор більше або дорівнює (>=)

//* Не суворе рівенство (==)

//* Суворе рівенство (===)

//* Не дорівнює (!=)

//* Суворе не дорівнює (!==)
